Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་དེ་བཞིན་གཤེགས་པའི་བཀའ་ཐོས་ནས་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འདིའི་དོན་གྱི་ཕྱིར་ཡོངས་སུ་སྐོམ་པས་བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ལ་དོན་འདིའི་སྐབས་བརྗོད་དེ་ཆོས་ཉན་པ་ཐམས་ཅད་འདུ་བར་གྱིས་ཤིག
en: Having heard the Tathāgata’s decree, the venerable Śāradvatī­putra, thirsting to hear the dhāraṇī of the jewel torch, told Indra, Brahmā, and the guardian deities of the world, “Gather all the Dharma listeners.

source: །དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འཆད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཀྱང་སྟོན་པར་འགྱུར་གྱིས་འདུ་བར་གྱིས་ཤིག །
en: Gather them because the Tathāgata is going to explain the dhāraṇī of the jewel torch and teach the inconceivable.

source: ཁྱེད་ཕྱིས་འགྱོད་པར་གྱུར་ཏ་རེ།
en: Later you will certainly regret missing it.

source: ཀྱེ་གྲོགས་པོ་དག་མདོ་སྡེ་རིན་པོ་ཆེ་འདི་ལྟ་བུ་དག་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་ཤིན་ཏུ་རྙེད་པར་དཀའོ།
en: Hey friends, it is extremely rare for precious sūtras like this to appear in the world!”

source: །དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་འདུས་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Then, at that very instant, Indra, Brahmā, and the guardian deities of the world gathered and circumambulated the Blessed One three times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: Taking their seats in the presence of the Blessed One, they humbly folded their hands and

source: བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་བཏབ་པ།
en: supplicated the Blessed One:

source: བཅོམ་ལྡན་འདས་ཀྱིས་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་བཤད་དུ་གསོལ།
en: “We ask that the Blessed One kindly explain the dhāraṇī of the jewel torch!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་བ་མཛད་དོ།
en: Then, by remaining silent, the Blessed One assented.

source: །བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་ལན་གཉིས་ལན་གསུམ་དུ་གསོལ་བ་བཏབ་ན་ཡང་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་ཏོ།
en: Although Indra, Brahmā, and the guardian deities of the world made their request to the Blessed One a second and third time, he still remained silent.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དཀོན་མཆོག་ཏ་ལ་ལ་ཞེས་བགྱི་བའི་གཟུངས་བཤད་དུ་གསོལ།
en: Then the venerable Śāradvatī­putra said, “I ask that the Blessed One kindly teach the dhāraṇī of the jewel torch!

source: བདེ་བར་གཤེགས་པས་བཤད་དུ་གསོལ།
en: I ask the Sugata to explain it!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཞལ་ནས་ལྗགས་ཀྱི་དབང་པོ་ཕྱུང་སྟེ།
en: At that time the Blessed One showed his tongue,

source: རིགས་ཀྱི་བུ་གང་ལ་ལ་དག་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འདིའི་དོན་གྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་འདེབས་པ་དེ་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ་ཞེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དབྱངས་ཀྱིས་གོ་བར་མཛད་དོ།
en: making these words understood throughout the entire billionfold world system: “Any son of a good family who implores the Tathāgata for the meaning of the dhāraṇī of the jewel torch will not turn back from insuperable perfect awakening.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One now told the venerable Śāradvatī­putra,

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་སོང་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཆོས་བཤད་པར་གསོལ་བ་ཐོབ་ཤིག
en: “Śāradvatī­putra, go ask Mañjuśrī Kumāra­bhūta to explain it!”

source: །དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཤིང་བླག་ཤ་དང་སཱ་ལའི་དྲུང་གཞན་ཞིག་ན་སྐྱིལ་མོ་ཀྲུང་བཅས་ཤིང་ལུས་མི་གཡོ་བར་འདུག་སྟེ།
en: At that time, Mañjuśrī Kumāra­bhūta was staying seated with a motionless body near the foot of some palāśa and sāla trees.

source: ཉི་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་པས་ལྷག་པའི་ཁ་དོག་བཀོད་པ་ཆེན་པོ་དང་ལྡན་པའི་ཁང་པ་བརྩེགས་པ་ན་བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་འདུག་པར་གྱུར་ཏེ།
en: He sat facing forward in a pavilion surrounded by the gods Indra, Brahmā, and the guardian deities of the world, with a form and complexion more radiant than countless millions of suns.

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་ལུས་དང་དཔལ་གྱིས་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེར་འདུག་གོ།
en: His body had a golden color, and he sat there illumined, bright, and resplendent.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་ར་དྭ་ཏིའི་བུས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The venerable Śāradvatī­putra approached Mañjuśrī Kumāra­bhūta and said,

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཁྱོད་ལ་ཆོས་བཤད་པར་གསོལ་བ་འདེབས་སོ།
en: “Son of a good family, the Tathāgata told me to request you to explain the Dharma.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: To this Mañjuśrī Kumāra­bhūta answered,

source: །བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་གཞིའི་དོན་འདི་གང་ཡིན།
en: “Honorable Śāradvatī­putra, what is the basic meaning of ‘tathāgata’?”

source: ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ།
en: Śāradvatī­putra said,

source: རིགས་ཀྱི་བུ་ཁྱོད་ནི་ཤེས་རབ་ཟབ་པ་སྟེ།
en: “Son of a good family, you have profound discriminating wisdom;

source: ཁོ་བོས་ནི་ཁྱོད་དང་འགྱེད་མི་ནུས་སོ།
en: I cannot debate with you.”

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ། ཁྱོད་སྙིང་ལས་ཆུང་ངུར་འདུག་ཤིག་དང་ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་བསྟན་པར་བྱའོ།
en: “Do not worry! I will teach according to what you can tolerate,” replied Mañjuśrī.

source: །ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོ་ཉན་གྱིས་ཁྱོད་ཀྱིས་ཤོད་ཅིག །
en: Śāradvatī­putra said, “Son of a good family, I will listen. You explain!”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་བྱས་སོ།
en: Then Mañjuśrī Kumāra­bhūta rose from his meditative absorption and with his voice made himself understood throughout the world realms of the billionfold world system.

source: །དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་ནས་འོག་མིན་གྱི་བར་གྱི་ལྷའི་བུ་ཇི་སྙེད་འཁོད་པ་དེ་དག་ཐམས་ཅད་འདུས་པར་གྱུར་ཏོ།
en: At that time, all the resident deities from the class of pure abodes down to the Akaniṣṭhā class gathered.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་ཡང་གནོད་སྦྱིན་བྱེ་བ་དུ་མ་དང་ལྷན་ཅིག་འདུས་པར་གྱུར་ཏོ།
en: Along with the four great kings and their troops and servants, several tens of millions of yakṣa deities assembled.

source: །བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱང་འདུས་པར་གྱུར་ཏོ།
en: Indra, Brahmā, and the guardian deities of the world gathered.

source: །ཆོས་འདོད་པ་རྣམས་དང་། །ཆོས་འདོད་པ་མ་ཡིན་པའི་གང་ཟག་རྣམས་ཀྱང་འདུས་པར་གྱུར་ཏོ། །ལྷའི་བུ་མོ་མང་པོ་ཡང་འདུས་པར་གྱུར་ཏོ།
en: Those who desired Dharma and even those who did not desire it congregated. Many goddesses also joined the gathering.

source: །དགེ་སློང་གི་འཁོར་དང་། དགེ་སློང་མའི་འཁོར་དང་། དགེ་བསྙེན་གྱི་འཁོར་དང་། དགེ་བསྙེན་མའི་འཁོར་དང་། དེ་བཞིན་དུ་སུམ་ཅུ་རྩ་གསུམ་པའི་བར་གྱི་འཁོར་དང་། འཐབ་བྲལ་གྱི་འཁོར་དང་། དགའ་ལྡན་གྱི་འཁོར་དང་། འཕྲུལ་དགའི་འཁོར་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་འཁོར་དང་། ཚངས་པའི་འཁོར་དང་། དེ་བཞིན་དུ་འོག་མིན་གྱི་བར་གྱི་ལྷའི་འཁོར་རྣམས་འདུས་པར་གྱུར་ཏོ།
en: A retinue of fully ordained monks, a retinue of fully ordained nuns, a retinue of novice monks, and a retinue of novice nuns came together. A retinue of gods from the Trāyastriṃśa class, a retinue of gods from the Yāma class, a retinue of gods from the Tuṣita class, a retinue of gods from the Nirmāṇarati class, a retinue of gods from the Paranirmitavaśavartin class, a retinue of gods from the Brahmā class, and likewise a retinue of gods from down to the Akaniṣṭhā class gathered.

source: །དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱང་འདུས་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱའི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་དང་། ཚེ་དང་ལྡན་པ་ག་ཡཱ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་གསུམ་པོ་ཆེ་དང་། ཚེ་དང་ལྡན་པ་ལམ་ཕྲན་བསྟན་དང་། ཚེ་དང་ལྡན་པ་ནམ་གྲུ་དང་། ཚེ་དང་ལྡན་པ་ཆུ་ཀླུང་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་དང་། ཚེ་དང་ལྡན་པ་བཟང་སྐྱོང་དང་། ཚེ་དང་ལྡན་པ་རླངས་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དེ་དག་དང་ཉན་ཐོས་ཆེན་པོ་གཞན་དག་དང་། གྲགས་འཛིན་ལ་སོགས་པ་དགེ་སློང་མ་ལྔ་བརྒྱ་ཡང་འདུས་པར་གྱུར་ཏོ།
en: Similarly, a gathering of great śrāvakas assembled, including the venerables Subhūti, Mahā­kāśyapa, Mahā­maudgalyā­yana, Śāradvatī­putra, Kātyāyana, Aniruddha, Gayā­kāśyapa, Koṣṭhila, Cūḍā­panthaka, Revata, Nadīkāśyapa, Urubilvā­kāśyapa, Pūrṇa­maitrāyaṇī­putra, Rāhula, Bhadra­pāla, Bāśya, and Ānanda—they and other great śrāvakas all gathered. Also, a group of five hundred fully ordained nuns led by Yaśodharā came.

source: །ཁམས་ཀྱི་རྒྱལ་པོ་དང་། སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་དག་ཀྱང་འདུས་པར་གྱུར་ཏོ། །རྒྱལ་རིགས་དང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་གི་འཁོར་དག་ཀྱང་འདུས་པར་གྱུར་ཏོ།
en: The rulers of the realms and universal emperors also joined the group, as did an assembly of kṣatriyas, brahmins, and householders.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Śāradvatī­putra circumambulated the Blessed One three times and said,

source: །བཅོམ་ལྡན་འདས་དེང་འདི་ལྟར་འཁོར་ཆེན་པོ་འདུས་པ་འདི་སུའི་མཐུ་ལགས།
en: “Blessed One, through whose power has this assembly gathered here and now?

source: དེ་ཇི་ལྟར་འཚལ་བར་བགྱི།
en: How are we to understand it?”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཀྱི་མཐུ་ཡིན་ནོ། །
en: “Venerable Śāradvatī­putra, it is the power of the dhāraṇī of the jewel torch.”

source: ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: Śāradvatī­putra declared,

source: བཅོམ་ལྡན་འདས་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་མཉན་པར་འཚལ་ལོ།
en: “Blessed One, I would like to learn the dhāraṇī of the jewel torch.”

source: ཤ་ར་དྭ་ཏིའི་བུ་སོང་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་ལ་གསོལ་བ་ཐོབ་ཤིག
en: “Śāradvatī­putra, go and ask Mañjuśrī Kumāra­bhūta and the bodhisattva Samanta­bhadra.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Śāradvatī­putra requested Mañjuśrī Kumāra­bhūta,

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཏིང་ངེ་འཛིན་རིན་པོ་ཆེ་བསྟན་པ་དཀོན་མཆོག་ཏ་ལ་ལ་འདི་ཤོད་ཅིག །
en: “Son of a good family, explain this teaching on the jewel of absorptions, the dhāraṇī of the jewel torch!”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī said,

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཉན་པར་འགྱུར་བ་སུ་ཡིན།
en: “Honorable Śāradvatī­putra, who is going to listen to the dhāraṇī of the jewel torch?”

source: འཁོར་བཞི་འདུས་པ་འདི་དག་དང་བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་རྣམས་འདུས་པ་འདི་དག་སྟེ།
en: “The members of the four parts of this assembly and Indra, Brahmā, and the guardian deities of the world will listen to it.

source: ཁོ་བོ་ཡང་ཉན་པའི་ཕྱིར་འོངས་སོ།
en: And I myself have come to listen to it.”

source: །གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཉན་པ་འདི་དག་ནི་སྒྱུ་མས་བྱུང་བ་ཤ་སྟག་ན་
en: “Elder Śāradvatī­putra, among those who listen to the Dharma who have arisen solely through illusion,

source: ཁོ་བོས་སུ་ལ་ཆོས་བཤད།
en: to whom will I explain the Dharma?

source: ཉན་པ་ནི་སུ་ཡིན།
en: Who is it that listens?

source: འཆད་པ་ནི་སུ་ཡིན།
en: Who is it that explains?”

source: གནས་བརྟན་གྱིས་སྨྲས་པ།
en: The elder answered,

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཤོད་ཅིག །ཁོ་བོས་མཉན་ཏོ།
en: “Noble one, you explain! I will listen.”

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བཤད་ཅེས་བྱ་བ་དེ་གང་གི་ཚིག་བླ་དགས་ཡིན།
en: “Honorable Śāradvatī­putra, what is ‘explaining’ an epithet for?”

source: སྨྲས་པ། འཇམ་དཔལ་བཤད་པ་ཞེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: Śāradvatī­putra replied, “Mañjuśrī, ‘explaining’ is an epithet for emptiness.”

source: སྨྲས་པ། ཤ་ར་དྭ་ཏིའི་བུ་སྟོང་པ་ཉིད་གང་གི་ཚིག་བླ་དགས་ཡིན།
en: “Śāradvatī­putra, what is ‘emptiness’ an epithet for?”

source: སྨྲས་པ། འཇམ་དཔལ་སྟོང་པ་ཉིད་ནི་ཚིག་མེད་པ་ཡིན་ནོ།
en: “Mañjuśrī, ‘emptiness’ is the absence of words.”

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་སྟོང་པ་ཉིད་ཚིག་མེད་པ་ཡིན་ན།
en: “Honorable Śāradvatī­putra, if emptiness is without words,

source: ཅི་ཞིག་བཤད་པར་བྱ།
en: how can we explain it?

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ནི་བསྟན་དུ་མེད་པ་ཡིན་ཏེ།
en: Honorable Śāradvatī­putra, all phenomena are impossible to teach.

source: དེ་དག་ནི་བསྟན་དུ་མེད་ཅིང་མཉན་དུ་མེད་དོ།
en: Śāradvatī­putra, they are unteachable and impossible to learn.”

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟ་བུ་བསྟན་པ་དེ་དག་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་བསྟན་པ།
en: “Son of a good family, all of those things that you thus have taught are explained as being emptiness.

source: མཚན་མ་མེད་པ་བསྟན་པ། སྨོན་པ་མེད་པ་བསྟན་པ། བླང་བ་མེད་པ་བསྟན་པ། དོར་བ་མེད་པ་བསྟན་པ། སྤྲོས་པ་མེད་པ་བསྟན་པ་སྟེ། མ་སྤྲོས་པ་བསྟན་པ་ཡིན་ནོ།
en: They are explained as being without phenomenal marks, wishless, without acceptance, without rejection, without conceptual elaborations, and unelaborated.”

source: །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དང་།
en: Then the fully endowed assembly of bodhisattvas,

source: བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ཀྱང་རབ་ཏུ་དགའ་ནས་
en: as well as Indra, Brahmā, and the guardian deities of the world, were very pleased.

source: མགྲིན་གཅིག་ཏུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འདི་ལེགས་པར་བཤད་དོ་ཞེས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: They declared unanimously that Mañjuśrī Kumāra­bhūta and the venerable Śāradvatī­putra’s teaching of the dhāraṇī of the jewel torch was well explained and excellent.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Subhūti said to Mañjuśrī Kumāra­bhūta:

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔས་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འདི་ཇི་ལྟར་གཟུང་བར་བྱ། བཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་བཤད་པར་བྱ།
en: “Mañjuśrī, how should a bodhisattva memorize, recite, study, or explain to others in great detail the dhāraṇī of the jewel torch?”

source: རབ་འབྱོར་གཟུངས་འདི་ནི་སྐྱེ་བ་མེད་པར་ཡིད་ལ་བྱའོ།
en: “Subhūti, this dhāraṇī should be thought of as birthless.

source: །དངོས་པོ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་། སྤྲོས་པ་མེད་པ་དང་། དོར་བ་མེད་པར་ཡིད་ལ་བྱའོ།
en: You should think of it as the absence of entities, without defining marks, without conceptual elaborations, and without rejecting.”

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་
en: When Mañjuśrī Kumāra­bhūta explained this Dharma discourse,

source: འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་དགུ་བཅུ་རྩ་གཉིས་ཀྱིས་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ།
en: from among that retinue ninety-two bodhisattvas gained the absorption heroic progress and sixty-two deities

source: །ལྷ་དང་མི་དྲུག་ཅུ་རྩ་གཉིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: and humans gained the acceptance of unborn phenomena.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་སྟན་ལས་ལངས་ཏེ་
en: Then the bodhisattva Samanta­bhadra rose from his seat and,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: covering one shoulder with his robe,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: addressed the Blessed One:

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ཅི་འདྲ་བ་ཞིག་ལགས།
en: “Blessed One, what sort of thing is the great compassion that the bodhisattva great beings have?”

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ནི་
en: “Son of a good family, regarding the great compassion of the bodhisattva great beings,

source: གང་ཁམས་གསུམ་པ་ཡོངས་སུ་མི་གཏོང་བ་སྟེ། འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: to not at all abandon the three realms is great compassion.

source: །གང་སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་དུ་སྟོན་པ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: To thoroughly display the buddhafields to all sentient beings is great compassion.

source: །གང་སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་ཡོངས་སུ་འཛིན་པ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: To receive into one’s care any sentient beings who are lax in their discipline is great compassion.

source: །གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་འདོར་བ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: To not abandon the perfection of wisdom is great compassion.

source: །གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་ལུས་དང་སྲོག་ཡོངས་སུ་གཏོང་བ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: To sacrifice one’s body and life for the sake of all sentient beings is great compassion.

source: །གང་འདོད་ཆགས་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་བྱམས་པ་ཡང་དག་པར་བརྗོད་པ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: To express loving kindness to sentient beings who are engaged in desire is great compassion.

source: །གང་སེམས་ཅན་སྟོབས་དང་ལྡན་རྣམས་ལ་བྱམས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་ནོ།
en: To have loving kindness for powerful sentient beings is the great compassion of the bodhisattva great beings.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱའོ།
en: Son of a good family, moreover, bodhisattva great beings should keep their minds free from animosity.

source: །འདྲེ་བ་མེད་པ་མང་དུ་བྱའོ།
en: They should practice being unassociated many times over.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva Samanta­bhadra said to the Blessed One,

source: སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་རྣམས་ཀྱི་དོན་དང་སྨན་པ་དང་། བདེ་བར་འགྱུར་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་དཀོན་མཆོག་ཏ་ལ་ལ་ཞེས་བགྱི་བའི་གཟུངས་བཤད་དུ་གསོལ།
en: “For the benefit of many beings, for the happiness of many beings, with kindness toward the world, for the majority of beings, and for the purpose and benefit of gods and humans and for their happiness, would the Blessed One kindly explain the dhāraṇī of the jewel torch?

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པ་དང་། ཐུགས་བརྩེ་བ་མངའ་བ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: For the benefit of all sentient beings, I beg the compassionate Blessed One to explain it!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པའི་དབྱངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One, with the voice of Brahmā, said to those bodhisattvas,

source: ཁྱེད་ཀྱི་ནང་ན་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་པའི་དུས་ཀྱི་ཚེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་སྤྲོ་བ་སུ་ཡོད།
en: “Who among you would like this Dharma discourse to be taught at a later time, at the time of the final five hundred years of the holy Dharma’s existence?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཐུ་ཆེན་ཐོབ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ངན་སོང་སྤོང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་བརྩེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ཀྱིས་མངོན་འཕགས་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་མི་ཟད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་ཟེ་བ་ལྡན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཙུག་ན་ནོར་བུ་ཅན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ལྟ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བལྟར་མི་མཐོང་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ལྟ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་ཕུང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དཀོན་མཆོག་འབྱུང་གནས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟོག་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནོར་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཙན་དན་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བདུད་རྩི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསམ་ཡས་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱིས་བརྒྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་གྱིས་བརྒྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཚན་གྱིས་བརྒྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་དགོད་ཅིང་དབང་པོ་ཐམས་ཅད་རབ་ཏུ་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིའི་རྩེ་མོ་རྡོབ་པའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་མཁས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ལག་བརྐྱང་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་མྱུར་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་དྲི་མ་མེད་པའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉི་གདུགས་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མངོན་འཕགས་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷུན་པོ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བརྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་དཔའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་གཉིས་ཀྱིས་མགྲིན་གཅིག་ཏུ་ཚིག་ཏུ་སྨྲས་པ།
en: Then sixty-two hundred billion bodhisattvas spoke unanimously, including the bodhisattvas Samanta­bhadra, Mañjuśrī Kumāra­bhūta, Avaloki­teśvara, Mahā­sthāmaprāpta, Avoiding Evil Destinies, Bhaiṣajya­rāja, Pratibhākūṭa, King Elevated by All Dharmas, Akṣaya­mati, Sāgara­mati, Anther-Possessing Jewel, Maṇiprabha, Maṇicūḍa, Observing, Not Seen when Viewed, Always Watching, Vajrapāṇi, Heap of Jewels, Ratnākara, Dharmaśrī, Glory of Thought, Dhanaśrī, Puṇyaketu, Candanaśrī, Dharma­mati, Amṛtamati, Unimaginable Intelligence, Ornamented with Merit, Ornamented by Good Qualities, Ornamented by Marks, Always Laughs and His Faculties All Rejoice, King Who Smashes the Peak of the Mountain, Expert Eloquence, Nityotkṣipta­hasta, Dhāraṇī­dhara, Quick Eloquence, Ākāśa­garbha, Essence of the Moon, Sūrya­garbha, Śaśi­vimala­garbha, Āditya­garbha, Superior King, Mahāmeru, Dṛḍhamati, Valiant Eloquence, and the bodhisattva great being Maitreya. They said,

source: བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ལྔ་བརྒྱ་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་པའི་དུས་ཀྱི་ཚེ་བདག་ཅག་ཐམས་ཅད་འདུས་ཤིང་ཚོགས་ཏེ་དཀོན་མཆོག་ཏ་ལ་ལ་ཞེས་བགྱི་བའི་གཟུངས་ཡང་དག་པར་བཤད་པར་སྤྲོ་ལགས་སོ།
en: “Blessed One, we all would be delighted if in later times, during the final five hundred years of the holy Dharma’s existence, we all assemble en masse so that the dhāraṇī of the jewel torch could then be fully explained.”

source: རིགས་ཀྱི་བུ་དག་ལེགས་སོ་ལེགས་སོ།
en: “Sons of good families, excellent, excellent!

source: །རིགས་ཀྱི་བུ་དག་འདི་ནི་བྱ་དཀའ་བ་སྟེ།
en: Sons of good families this is difficult to do.

source: ཆོས་འདི་འདྲ་བ་འདི་ནི་ཤིན་ཏུ་བྱ་དཀའ་བའོ།
en: A ceremony like this is extremely difficult.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then the Blessed One said to the bodhisattva Samanta­bhadra,

source: །རིགས་ཀྱི་བུ་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བར་འགྱུར་བ་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཉོན་ཅིག །
en: “Son of a good family, for the benefit and happiness of many beings, listen to the dhāraṇī of the jewel torch.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀོད་པ་ཆེན་པོའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཏེ་སྔགས་བཀའ་སྩལ་པ།
en: Then the Blessed One sat upon an elaborate lion’s throne and spoke the mantra:

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all tathāgatas, arhats, and perfectly awakened buddhas!

source: ཏདྱ་ཐཱ། ཨོཾ་མྃ། བྷ་ར་ཏེ། བྷ་ར་ཏེ། བྷ་ར་བྷ་ར་ན་ཏེ་སྭཱ་ཧཱ།
en: Tadyathā oṃ maṃ bharate bharate bhara bharanate svāhā.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཨ་ལ་ལ་ཆོས། ཨ་ལ་ལ་ཆོས། ཨ་ལ་ལ་ཆོས་ཞེས་ལན་གཉིས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་པ་མཛད་དོ།
en: Then the Blessed One solemnly declared once, then a second time and a third time, “How wonderful is the Dharma, How wonderful is the Dharma, How wonderful is the Dharma!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattva Samanta­bhadra asked the Blessed One,

source: །བཅོམ་ལྡན་འདས་ཆོས་ཆོས་ཞེས་བགྱི་བ་འདིའི་གཞིའི་དོན་གང་ལགས།
en: “Blessed One, when you say ‘Dharma, Dharma,’ what is its basic meaning?”

source: རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ཀྱི་གཞིའི་དོན་ནི་གཞི་མེད་པའི་དོན་ཏོ།
en: “Son of a good family, the basic meaning of all dharmas is the meaning of having no basis.

source: །ཆོས་ཐམས་ཅད་ཀྱི་གཞིའི་དོན་ནི་དངོས་པོ་མེད་པའི་གཞིའི་དོན་ཏོ།
en: The basic meaning of all dharmas is the basic meaning of the absence of entities.

source: །ཆོས་ཐམས་ཅད་ཀྱི་གཞིའི་དོན་ནི་ནམ་མཁའི་གཞིའི་དོན་ཏོ།
en: The basic meaning of all dharmas is the basic meaning of space.

source: །ཆོས་ཐམས་ཅད་ཀྱི་གཞིའི་དོན་ནི་བླང་བ་མེད་པའི་གཞིའི་དོན་ཏོ།
en: The basic meaning of all dharmas is the basic meaning of not accepting.

source: །ཆོས་ཐམས་ཅད་ཀྱི་གཞིའི་དོན་ནི་དོར་བ་མེད་པའི་གཞིའི་དོན་ཏོ།
en: The basic meaning of all dharmas is the basic meaning of not rejecting.”
